[
{
    "title": "‘Really huge’ unexploded WWII bomb found outside Paris triggers major rail disruption",
    "date": "11:13 AM EST, Fri March 7, 2025",
    "author": "Joseph Ataman",
    "content": "Trains to and from Paris were heavily disrupted following the discovery of an unexploded World War II bomb early on Friday near the world’s third-busiest train station.\n     \n            Almost 500 trains were canceled and the disruption affected around 600,000 people at the Gare du Nord, the tra...",
    "url": "https://edition.cnn.com/2025/03/07/europe/wwii-bomb-paris-halts-eurostar-travel-london-northern-france-intl-hnk/index.html"
},
{
    "title": "Malala Yousafzai returns to Pakistan hometown for first time since she was shot",
    "date": "6:02 AM EST, Fri March 7, 2025",
    "author": "Lianne Kolirin",
    "content": "has returned to her hometown in  , 13 years after she was shot in the head by the Taliban.\n     \n            The 27-year-old Nobel Peace Prize winner shared a picture of herself in the stunning landscape of northern Pakistan on  , saying it was the first time she had been back there since she was...",
    "url": "https://edition.cnn.com/2025/03/07/asia/malala-pakistan-hometown-scli-intl/index.html"
},
{
    "title": "Chelsea’s 2024 squad was the most expensive in European history, says UEFA report",
    "date": "6:23 AM EST, Fri March 7, 2025",
    "author": "N/A",
    "content": "Chelsea’s squad at the end of the 2024 financial year was the most expensive ever assembled in   in terms of transfer fees, according to a report released by governing body UEFA.\n     \n            The “ ” report said Chelsea spent 1.656 billion euros ($1.79 billion) on combined transfer costs.\n  ...",
    "url": "https://edition.cnn.com/2025/03/07/sport/chelsea-squad-value-uefa-spt-intl/index.html"
},
{
    "title": "Lying sideways on the moon, the Athena lander is declared dead",
    "date": "3:57 PM EST, Fri March 7, 2025",
    "author": "Jackie Wattles",
    "content": ".\n \n            Intuitive Machines, the Houston-based company that was set to deliver a historic water-hunting mission to the moon’s south pole, announced Friday that its   has powered down just one day after arriving at the lunar surface.\n     \n            Athena was expected to operate for abou...",
    "url": "https://edition.cnn.com/2025/03/07/science/intuitive-machines-athena-mission-concluded/index.html"
},
{
    "title": "D’Wayne Wiggins of Tony! Toni! Toné! dead at 64",
    "date": "2:50 PM EST, Fri March 7, 2025",
    "author": "Lisa Respers France",
    "content": "D’Wayne Wiggins, singer and guitarist for the popular R&B group Tony! Toni! Toné! has died after a battle with cancer, his family announced on the group’s verified social media Friday.\n     \n            He was 64.\n     \n            “With broken hearts, we share with you that our beloved D’Wayne p...",
    "url": "https://edition.cnn.com/2025/03/07/entertainment/dwayne-wiggins-tony-toni-tone-death/index.html"
},
{
    "title": "Kate Hudson likes ‘the idea of being engaged forever’",
    "date": "9:22 AM EST, Fri March 7, 2025",
    "author": "Lisa Respers France",
    "content": "It sounds like Kate Hudson has a case of like mother, like daughter.\n     \n            Her mother, fellow actress Goldie Hawn, has been in a relationship with her partner, actor Kurt Russell, for more than 40 years, though the two have never wed.\n     \n            During an appearance on  ,” Huds...",
    "url": "https://edition.cnn.com/2025/03/07/entertainment/kate-hudson-likes-being-engaged-forever/index.html"
},
{
    "title": "Teenager João Fonseca continues stunning rise with first-round win at Indian Wells, Nick Kyrgios tearfully bows out",
    "date": "6:44 AM EST, Fri March 7, 2025",
    "author": "George Ramsay",
    "content": "Only a few years ago,   was a young   fan eager to collect autographs from the world’s top players. Now, kids are starting to queue up for his signature.\n     \n            The 18-year-old is fast becoming one of the most exciting talents in men’s tennis, and on Thursday, he continued to impress w...",
    "url": "https://edition.cnn.com/2025/03/07/sport/joao-fonseca-indian-wells-tennis-spt-intl/index.html"
},
{
    "title": "Shaun White was a record-breaking snowboarder. Now, he’s started a new competition to unify a ‘disjointed’ sport",
    "date": "10:49 AM EST, Fri March 7, 2025",
    "author": "Ben Morse",
    "content": "When it comes to knowing a thing or two about  , there’s nobody better than Shaun White.\n     \n            White is arguably the greatest of all time in his field, having won 23 X Games medals – including 15 golds – and holding the record for the most snowboarding   with three.\n     \n            ...",
    "url": "https://edition.cnn.com/2025/03/07/sport/shaun-white-snow-league-snowboarding-olympics-spt-intl/index.html"
},
{
    "title": "System needs to ‘reinvent itself’: Tennis has an anti-doping procedural problem, critics say",
    "date": "5:00 AM EST, Fri March 7, 2025",
    "author": "Issy Ronald",
    "content": "For months, the   world has simmered with controversy in the wake of two doping cases involving top-ranking players: first, men’s player   and months later, women’s player  .\n     \n            And when the   (WADA) announced on February 15 that Sinner had accepted a three-month ban to settle his ...",
    "url": "https://edition.cnn.com/2025/03/07/sport/tennis-anti-doping-reaction-sinner-spt-intl/index.html"
},
{
    "title": "Fired employee says NOAA layoffs will affect storm preparations",
    "date": "6:26 PM EST, Wed March 5, 2025",
    "author": "MJ Lee",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/05/weather/video/noaa-layoffs-affect-weather-storm-preparations-lee-pkg-digvid"
},
{
    "title": "Hamas says ready to maintain direct talks with US but accuses Trump of double standards",
    "date": "9:16 AM EST, Fri March 7, 2025",
    "author": "N/A",
    "content": "A senior Hamas figure in Gaza has accused   of “blatant double standards” in his demand for the immediate release of hostages still held in Gaza – but told CNN that Hamas’ direct meetings with US officials “aim to achieve stability in the region.”\n     \n            Mushir al-Masri was speaking to...",
    "url": "https://edition.cnn.com/2025/03/07/middleeast/hamas-reaction-us-talks-hostages-intl/index.html"
},
{
    "title": "Dolly Parton releases new song dedicated to her late husband",
    "date": "8:55 AM EST, Fri March 7, 2025",
    "author": "N/A",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/07/entertainment/video/dolly-parton-new-song-carl-dean-digvid"
},
{
    "title": "The National Park Service set a visitation record in 2024. Here are the top sites",
    "date": "8:19 AM EST, Fri March 7, 2025",
    "author": "Forrest Brown",
    "content": "Boy did Americans and other visitors make good use of US National Park Service sites in 2024 — enough to set a record.\n     \n            The NPS has reached a new overall milestone, with almost 331.9 million recreation visits logged at all  , which include famous national parks such as Yellowston...",
    "url": "https://edition.cnn.com/2025/03/07/travel/most-visited-us-national-park-sites-2024/index.html"
},
{
    "title": "N/A",
    "date": "5:09 PM EST, Fri March 7, 2025",
    "author": "Tori B. Powell",
    "content": "No content available",
    "url": "https://edition.cnn.com/us/live-news/investigation-update-gene-hackman-death-03-07-25/index.html"
},
{
    "title": "She traveled to Italy to save her marriage. Here’s how she ended up falling for her Italian tour guide",
    "date": "8:39 AM EST, Fri February 28, 2025",
    "author": "Francesca Street",
    "content": "When Monica Kennedy booked the trip to the Amalfi Coast, she was hoping the time in Italy would save her marriage.\n     \n            It was 2017. Monica lived in a nice house in Connecticut in the United States. She worked as a clinical paralegal at Yale Law School. She’d been married for over 20...",
    "url": "https://edition.cnn.com/travel/amalfi-coast-tour-guide-chance-encounters/index.html"
},
{
    "title": "The photographer capturing the ‘indescribable magic’ of Australia’s landscapes",
    "date": "8:15 PM EST, Thu March 6, 2025",
    "author": "Rebecca Cairns",
    "content": "Editor’s Note: Call to Earth is a CNN editorial series committed to reporting on the environmental challenges facing our planet, together with the solutions.   has partnered with CNN to drive awareness and education around key sustainability issues and to inspire positive action.\n \n            Wh...",
    "url": "https://edition.cnn.com/style/lisa-michele-burns-australia-landscape-photographer-hnk-spc-c2e/index.html"
},
{
    "title": "Sam Bankman-Fried describes his relationship with Diddy in jail",
    "date": "10:18 AM EST, Fri March 7, 2025",
    "author": "Jordan Valinsky",
    "content": "Sam Bankman-Fried, the convicted crypto fraudster who is  , is breaking his silence about his life behind bars in a new interview with Tucker Carlson.\n     \n            One major point of interest about Bankman-Fried has been about whether he has befriended disgraced  , who is serving time in the...",
    "url": "https://edition.cnn.com/2025/03/07/business/sam-bankman-fried-prison-interview-diddy/index.html"
},
{
    "title": "Ancient rock carvings in Qatar",
    "date": "4:51 AM EST, Mon November 22, 2021",
    "author": "N/A",
    "content": "No content available",
    "url": "https://edition.cnn.com/travel/gallery/ancient-rock-carvings-in-qatar/index.html"
},
{
    "title": "Millie Bobby Brown responds to articles criticizing her appearance",
    "date": "6:26 AM EST, Tue March 4, 2025",
    "author": "Leah Dolan",
    "content": "Millie Bobby Brown has spoken out against a series of articles criticizing her appearance during her ongoing press tour for the Netflix film, “The Electric State.” On Monday, the “Stranger Things” actor posted a video on Instagram where she called out the media for “bullying” and “tearing young w...",
    "url": "https://edition.cnn.com/2025/03/04/style/millie-bobby-brown-responds-to-media-criticism-appearance/index.html"
},
{
    "title": "Halle Berry gets ‘payback’ on Adrien Brody at the Oscars — with a kiss",
    "date": "10:33 AM EST, Mon March 3, 2025",
    "author": "Scottie Andrew",
    "content": "Adrien Brody entered Oscars infamy in 2003, when he pulled Halle Berry into an impromptu kiss onstage.\n     \n            On the Oscars red carpet on Sunday, Halle Berry had her revenge.\n     \n            In jest, of course. Berry, an   stole a smooch from Brody before the ceremony began. The pair...",
    "url": "https://edition.cnn.com/2025/03/02/entertainment/halle-berry-adrien-brody-kiss-oscars-cec/index.html"
},
{
    "title": "Here’s every film that won the Oscar for best picture",
    "date": "11:50 PM EST, Sun March 2, 2025",
    "author": "N/A",
    "content": "No content available",
    "url": "https://edition.cnn.com/2022/02/07/entertainment/gallery/oscar-best-picture-winners/index.html"
},
{
    "title": "What will cost Americans more from sweeping tariffs on Mexico, China and Canada",
    "date": "7:51 AM EST, Tue March 4, 2025",
    "author": "Elisabeth Buchwald",
    "content": "American consumers and businesses stand to pay a hefty price for the tariffs President Donald Trump enacted on the nation’s top three trading partners.\n     \n            With only a slim exemption for some Canadian energy products, everything the US imports from those three nations is subject to ...",
    "url": "https://edition.cnn.com/2025/03/04/economy/what-cost-more-americans-us-tariffs/index.html"
},
{
    "title": "In pictures: Muslims around the world observe Ramadan",
    "date": "1:23 AM EST, Sat March 1, 2025",
    "author": "N/A",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/01/world/gallery/ramadan-2025/index.html"
},
{
    "title": "In pictures: The 2025 Academy Awards",
    "date": "11:40 PM EST, Sun March 2, 2025",
    "author": "Brook Joyner",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/02/entertainment/gallery/2025-academy-award-ceremony/index.html"
},
{
    "title": "US aviation safety ‘no longer the gold standard,’ according to statements at House hearing",
    "date": "10:20 AM EST, Wed March 5, 2025",
    "author": "Alexandra Skores",
    "content": "For decades, US officials liked to say the nation’s aviation system was the “gold standard” for safety. A House hearing on Tuesday cast doubt on that assertion.\n     \n            At the hearing, on problems with the nation’s air traffic control system, lawmakers pressed aviation organizations on ...",
    "url": "https://edition.cnn.com/2025/03/04/business/faa-us-aviation-safety/index.html"
},
{
    "title": "Gene Hackman wanted to be remembered as a ‘decent actor.’ He far surpassed that with these roles",
    "date": "12:53 AM EST, Mon March 3, 2025",
    "author": "Lisa Respers France",
    "content": "knew how he wanted to be remembered.\n     \n            “As a decent actor,”  . “As someone who tried to portray what was given to them in an honest fashion.”\n     \n            His career is now being reflected upon as the 95-year-old actor, his wife Betsy Arakawa and their dog   earlier this week...",
    "url": "https://edition.cnn.com/2025/03/02/entertainment/gene-hackman-memorable-roles/index.html"
},
{
    "title": "This boba chain you’ve never heard of has more outlets than McDonald’s",
    "date": "4:11 AM EST, Mon March 3, 2025",
    "author": "John Liu",
    "content": "Two decades ago, a modest restaurant in the middle of one of China’s poorest provinces saw its business take off after selling cut-price soft serve for just 1 yuan (15 cents) per cone. Today, it has overtaken McDonald’s and Starbucks as the world’s largest food and beverage chain by number of sto...",
    "url": "https://edition.cnn.com/2025/03/03/business/china-mixue-bingcheng-ipo-expansion-intl-hnk/index.html"
},
{
    "title": "In pictures: NBA great LeBron James",
    "date": "11:18 PM EST, Tue March 4, 2025",
    "author": "Kyle Almond",
    "content": "No content available",
    "url": "https://edition.cnn.com/2023/02/08/sport/gallery/lebron-james/index.html"
},
{
    "title": "Why scientists say this stunning ancient lake in Turkey might as well be on Mars",
    "date": "5:30 AM EST, Thu March 6, 2025",
    "author": "Ali Halit Diker",
    "content": "Editor’s Note:  \n \n            With its vivid turquoise, green and blue waters, it’s no surprise Lake Salda is often promoted as the “Maldives of Turkey.”\n     \n            Extraordinary to look at, peaceful and surrounded by an abundance of wildlife, it’s little wonder if has become a significan...",
    "url": "https://edition.cnn.com/travel/lake-salda-mars-turkey-analog/index.html"
},
{
    "title": "Facebook enables gender discrimination in job ads, European human rights body rules",
    "date": "10:41 AM EST, Fri February 28, 2025",
    "author": "Carlotta Dotto",
    "content": "Editor’s Note: This story is part of ‘ , a series by CNN’s As Equals, investigating how your gender shapes your life online. For information about how CNN As Equals is funded and more,  .\n \n            A European human rights body has ruled that Facebook’s algorithm shows gender bias when promoti...",
    "url": "https://edition.cnn.com/2025/02/28/tech/facebook-gender-discrimination-europe-ruling-asequals-intl/index.html"
},
{
    "title": "Trump announces Taiwanese chipmaking giant TSMC to invest $100 billion in US manufacturing",
    "date": "9:19 PM EST, Mon March 3, 2025",
    "author": "Clare Duffy",
    "content": "Chipmaking giant Taiwan Semiconductor Manufacturing Company plans to invest at least $100 billion to grow its US manufacturing operations, President Donald Trump announced from the White House on Monday alongside the firm’s CEO C.C. Wei, Commerce Secretary Howard Lutnick and White House AI and Cr...",
    "url": "https://edition.cnn.com/2025/03/03/tech/tsmc-trump-meeting-chipmaking-investment/index.html"
},
{
    "title": "5 things this ER doctor would like everyone to stop doing",
    "date": "10:00 AM EST, Wed March 5, 2025",
    "author": "Katia Hetter",
    "content": ".\n \n            People are rushed to the hospital emergency room for all sorts of unavoidable injuries, whether they got hit by a car or injured while playing sports.\n     \n            Then there are the injuries and other conditions that emergency physicians treat regularly that are often preven...",
    "url": "https://edition.cnn.com/2025/03/05/health/er-doctor-stop-doing-five-things-wellness/index.html"
},
{
    "title": "Why those reports of DOGE using AI have experts worried about ‘massive risk’",
    "date": "6:00 AM EST, Tue March 4, 2025",
    "author": "Clare Duffy",
    "content": "Elon Musk’s Department of Government Efficiency team is reportedly using artificial intelligence to guide its cost-cutting decisions, a tactic AI experts say could cause security breaches, biased firing choices and cuts of highly qualified, essential government staffers.\n     \n            “It’s j...",
    "url": "https://edition.cnn.com/2025/03/04/tech/doge-ai-government-cuts-expert-concerns/index.html"
},
{
    "title": "Common vaginal condition is really an STD, study finds",
    "date": "4:42 PM EST, Thu March 6, 2025",
    "author": "Sandee LaMotte",
    "content": ".\n \n            A common but potentially dangerous vaginal infection that affects   globally should be considered a sexually transmitted disease, a new study says.\n     \n            Bacterial vaginosis, or BV, is currently viewed as a woman’s issue, thus leaving the sexual partner untreated.\n    ...",
    "url": "https://edition.cnn.com/2025/03/05/health/bacterial-vaginosis-sexually-transmitted-wellness/index.html"
},
{
    "title": "YouTube cracks down on gambling videos trying to lure viewers to unapproved sites",
    "date": "11:30 AM EST, Tue March 4, 2025",
    "author": "Clare Duffy",
    "content": "YouTube is cracking down on content related to gambling as sports betting and other online prediction markets have taken off in the United States.\n     \n            The platform announced Tuesday it will no longer allow content that directs users to “unapproved” gambling websites through links, i...",
    "url": "https://edition.cnn.com/2025/03/04/tech/youtube-online-gambling-rules/index.html"
},
{
    "title": "Replacing butter for some plant oils could significantly lower risk of mortality, new study finds",
    "date": "5:36 PM EST, Thu March 6, 2025",
    "author": "Julianna Bragg",
    "content": "Editor’s Note:  \n \n            Swapping your daily butter intake for certain plant-based oils may help reduce your risk of death, a new study finds.\n     \n            These findings challenge the growing social media trend that attacks seed oils in favor of butter, ghee and animal fats.\n     \n   ...",
    "url": "https://edition.cnn.com/2025/03/06/health/butter-seed-oils-reduced-death-wellness/index.html"
},
{
    "title": "Trump’s White House has taken over the Justice Department’s PR strategy",
    "date": "5:39 PM EST, Mon March 3, 2025",
    "author": "Hannah Rabinowitz",
    "content": "Attorney General Pam Bondi appeared on Fox News last week to tease a major event: The Justice Department would release long-awaited documents related to accused  .\n     \n            But as reporters waited inside the department and members of public watched for the tranche of documents to be rele...",
    "url": "https://edition.cnn.com/2025/03/03/politics/justice-department-stephen-miller-strategy/index.html"
},
{
    "title": "A protest in pink: Democrats respond to Trump’s speech through clothes",
    "date": "12:18 PM EST, Wed March 5, 2025",
    "author": "Leah Dolan",
    "content": "As President Trump addressed a joint session of Congress at the US Capitol on Tuesday night — the   first speech the House chamber has seen since 1964 — the reaction was mixed. Rep. Al Green, a Texas Democrat, was removed for heckling, while some attendees held up signs reading “false” and “lies....",
    "url": "https://edition.cnn.com/2025/03/05/style/a-protest-in-pink-democrats-respond-to-trumps-speech-through-clothes/index.html"
},
{
    "title": "Don’t overdo it, but light exercise can help with minor illness",
    "date": "12:24 PM EST, Fri March 7, 2025",
    "author": "Melanie Radzicki McManus",
    "content": "The winter flu season is still in full force, according to the  , causing many sufferers to halt their exercise regimen. But not every illness requires you to set down your gym bag. While moderate to severe ailments require a certain amount of rest and recovery, mild illnesses may improve with mo...",
    "url": "https://edition.cnn.com/2025/03/07/health/exercising-when-sick-wellness/index.html"
},
{
    "title": "Ireland’s oldest university names its first building after a woman. It only took 433 years",
    "date": "5:18 AM EST, Thu March 6, 2025",
    "author": "Kathy Rose O'Brien",
    "content": "Trinity College Dublin may have been founded by Queen Elizabeth I, but for over 400 years every building on the prestigious university campus has been named after a man. Until now.\n     \n            This month, an official ceremony marks the renaming of one of the main libraries at Ireland’s lead...",
    "url": "https://edition.cnn.com/2025/03/06/style/eavan-boland-trinity-college-library-intl/index.html"
},
{
    "title": "US charges Chinese hackers who allegedly caused millions of dollars’ worth of damages",
    "date": "2:19 PM EST, Wed March 5, 2025",
    "author": "Sean Lyngaas",
    "content": "US prosecutors on Wednesday announced criminal charges against a dozen Chinese nationals for allegedly hacking a range of US companies, government agencies and municipalities, in some cases for profit and causing millions of dollars’ worth of damage.\n     \n            Victims of the hackers inclu...",
    "url": "https://edition.cnn.com/2025/03/05/politics/us-charges-chinese-hackers/index.html"
},
{
    "title": "Luka Dončić and LeBron James lead LA Lakers to thrilling OT win over New York Knicks, extend win streak",
    "date": "4:43 AM EST, Fri March 7, 2025",
    "author": "Jacob Lev",
    "content": "Hours after the last time the Los Angeles Lakers and New York Knicks met, one of the most shocking trades in NBA history went down as LA acquired superstar Luka Dončić in a three-team deal that shook the league.\n     \n            On Thursday, the two teams faced each other again, this time at Cry...",
    "url": "https://edition.cnn.com/2025/03/07/sport/la-lakers-new-york-knicks-nba-spt/index.html"
},
{
    "title": "‘Merit board’ chair was unlawfully fired by Trump, judge rules, keeping her on the job",
    "date": "4:55 PM EST, Tue March 4, 2025",
    "author": "Marshall Cohen",
    "content": "The chairwoman of   that reviews federal employee firings can stay on the job, a judge ruled Tuesday, formally reversing President Donald Trump’s “unlawful” decision to fire her.\n     \n            District Judge Rudolph Contreras  , chair of the Merit Systems Protection Board, an independent agen...",
    "url": "https://edition.cnn.com/2025/03/04/politics/cathy-harris-merit-board-fired-trump/index.html"
},
{
    "title": "Ricardo Scofidio, architect of New York’s High Line, dies age 89",
    "date": "3:26 AM EST, Fri March 7, 2025",
    "author": "Oscar Holland",
    "content": "Architect Ricardo Scofidio, whose work co-designing museums, art venues and public spaces — including New York City’s   — reshaped America’s cultural landscape, has died age 89.\n     \n            A statement posted to the website of Diller Scofidio + Renfro, the influential architecture practice ...",
    "url": "https://edition.cnn.com/2025/03/07/style/ricardo-scofidio-high-line-architect-death/index.html"
},
{
    "title": "Michael Jordan’s and Kobe Bryant’s first-ever NBA jerseys expected to sell for $10 million apiece",
    "date": "5:03 AM EST, Fri March 7, 2025",
    "author": "Rosa Rahimi",
    "content": "Jerseys worn by   and   in the first NBA games of their careers could sell for millions of dollars when they go up for auction this spring.\n     \n            Representing the basketball legends’ “humble beginnings,” they are expected to sell for a combined $20 million, according to a press releas...",
    "url": "https://edition.cnn.com/2025/03/06/style/michael-jordan-kobe-bryant-jersey-auction-intl-scli/index.html"
},
{
    "title": "Supreme Court lets San Francisco discharge more raw sewage into the Pacific Ocean",
    "date": "10:54 AM EST, Tue March 4, 2025",
    "author": "John Fritze",
    "content": "The conservative Supreme Court   on Tuesday, ruling that federal environmental regulators overstepped their authority by attempting to impose vague limits on how much raw sewage the California city may pump into the Pacific Ocean.\n     \n            Conservative Justice Samuel Alito wrote the opin...",
    "url": "https://edition.cnn.com/2025/03/04/politics/supreme-court-san-francisco-poop-epa/index.html"
},
{
    "title": "Canadians in crosshairs of trade war call Trump’s tariffs a ‘bad dream’",
    "date": "5:31 PM EST, Thu March 6, 2025",
    "author": "John King",
    "content": "Karim Walji is certain he is about to lose business. Worried he may have to shrink his workforce — fire people — for the first time in eight years. He blames President   and what Walji sees as a reckless power trip.\n     \n            “He wants the US to flex their muscle,” said Walji, a partner i...",
    "url": "https://edition.cnn.com/2025/03/06/politics/canada-trump-tariffs-impact/index.html"
},
{
    "title": "The ‘economic blackout’ movement now wants you to boycott Amazon, starting today",
    "date": "6:34 AM EST, Fri March 7, 2025",
    "author": "Jordan Valinsky",
    "content": "A grassroots movement’s call for Americans not to shop at major chains for 24 hours in an “ ” last week went viral — and now, its organizer is launching a weeklong boycott against Amazon that starts Friday.\n     \n            John Schwarz, the 57-year-old founder of The People’s Union USA, is call...",
    "url": "https://edition.cnn.com/2025/03/07/business/amazon-economic-blackout/index.html"
},
{
    "title": "A Ramadan etiquette guide for non-Muslims",
    "date": "10:24 AM EST, Fri February 28, 2025",
    "author": "Saeed Ahmed",
    "content": "There are   people in the world. And   are fasting from sunup to sundown. Every day. For an entire month.\n     \n            It’s  , and it’s the holiest month of the Muslim calendar. In 2025, it runs roughly from February 28 to March 30.\n     \n            But what if you’re not a Muslim and inste...",
    "url": "https://edition.cnn.com/travel/ramadan-etiquette-guide-non-muslims/index.html"
},
{
    "title": "Wall Street is turning its back on Elon Musk",
    "date": "4:14 PM EST, Thu March 6, 2025",
    "author": "Chris Isidore",
    "content": "Liberals and government employees aren’t the only people angry with Elon Musk. Tesla’s plunging share price means many investors are angry, too.\n     \n            Shares of Tesla shot up 91% after election day, peaking just before Christmas, as investors anticipated Musk and his car company would...",
    "url": "https://edition.cnn.com/2025/03/06/business/musk-trump-tesla-shares-slide/index.html"
},
{
    "title": "Crypto executives descend on DC for a victory lap — and to give Trump a round of applause",
    "date": "10:01 AM EST, Fri March 7, 2025",
    "author": "Allison Morrow",
    "content": ".\n \n            The crypto industry is buzzing ahead of Friday’s White House summit on digital assets.\n     \n            That’s a sentence that would have been laughable just a couple of years ago. Crypto kingpins rubbing elbows with the president and the head of the Securities and Exchange Commi...",
    "url": "https://edition.cnn.com/2025/03/07/business/crypto-summit-white-house-reserve-nightcap/index.html"
},
{
    "title": "‘I’m very impulsive’: Why this American woman moved to France at the age of 70",
    "date": "8:48 AM EST, Mon March 3, 2025",
    "author": "Tamara Hardingham-Gill",
    "content": "She’d dreamed of living in France for years, but according to Janice Deerwester, originally from Texas, life always seemed to get in the way.\n     \n            In 2021, Janice, who has been a widow since 2012, found herself lying on her bed with the lyrics to “Is That All There Is?,” a song about...",
    "url": "https://edition.cnn.com/travel/janice-deerwester-american-woman-moved-france-age-70/index.html"
},
{
    "title": "Frequent flyers have spent years staying loyal to airlines. Now airlines are giving them ‘the middle finger’",
    "date": "6:00 AM EST, Sat February 22, 2025",
    "author": "Julia Buckley",
    "content": "Imagine you’re booking a flight.\n     \n            For most people, it’s an easy decision: the cheapest fare or the easiest route will be the one to win out. But for many, it’s a different scenario. They’re willing to spend more, fly at awkward times or even make multiple connections to reach the...",
    "url": "https://edition.cnn.com/travel/airline-loyalty-programs-points-2025-changes/index.html"
},
{
    "title": "What it’s like to travel as a woman in Saudi Arabia",
    "date": "6:26 AM EST, Fri March 7, 2025",
    "author": "N/A",
    "content": "Editor’s Note: This CNN Travel series is, or was, sponsored by the country it highlights. CNN retains full editorial control over subject matter, reporting and frequency of the articles and videos within the sponsorship,  .\n \n            Saudi Arabia’s historic treasures were long hidden behind a...",
    "url": "https://edition.cnn.com/travel/what-its-like-to-travel-as-a-woman-in-saudi-arabia/index.html"
},
{
    "title": "Archaeologists uncovered a cache of 1.5 million-year-old bone tools. They’re trying to determine who made them",
    "date": "1:13 PM EST, Wed March 5, 2025",
    "author": "Ashley Strickland",
    "content": ".\n \n            Archaeologists have uncovered a collection of bone tools in northern Tanzania that were shaped by ancient human ancestors 1.5 million years ago, making them the oldest known bone tools by about 1 million years, according to new research.\n     \n            Researchers have unearthe...",
    "url": "https://edition.cnn.com/2025/03/05/science/oldest-bone-tools-hominins/index.html"
},
{
    "title": "Firefly shares video of Blue Ghost’s nail-biting descent to the lunar surface",
    "date": "8:34 AM EST, Wed March 5, 2025",
    "author": "Jackie Wattles",
    "content": ".\n \n            Firefly Aerospace, the Texas-based startup that on Sunday became only the second private-sector company to soft-land a spacecraft on the moon,   from the moment its   on the lunar surface.\n     \n            Blue Ghost shared the footage after successfully deploying an X-band anten...",
    "url": "https://edition.cnn.com/2025/03/05/science/blue-ghost-moon-landing-footage/index.html"
},
{
    "title": "Scientists created a ‘woolly mouse’ with mammoth traits. Is it a step toward bringing back the extinct giant?",
    "date": "5:27 PM EST, Wed March 5, 2025",
    "author": "Katie Hunt",
    "content": ".\n \n            It’s tiny, but this lab mouse could have a mammoth impact.\n     \n            With curly whiskers and wavy, light hair that grows three times longer than that of an ordinary lab mouse, the genetically modified rodent embodies several woolly mammoth-like traits, according to Colossa...",
    "url": "https://edition.cnn.com/2025/03/04/science/woolly-mouse-mammoth-resurrection-colossal/index.html"
},
{
    "title": "Pamela Bach, actor and ex-wife of David Hasselhoff, dies at 62",
    "date": "12:13 AM EST, Fri March 7, 2025",
    "author": "N/A",
    "content": "Pamela Bach, an actor and the ex-wife of “Baywatch” star David Hasselhoff, has died at 62.\n     \n            The Los Angeles medical examiner’s office reports that she died Wednesday and determined her death was a suicide. Also known as Pamela Hasselhoff, Bach appeared on “The Young and the Restl...",
    "url": "https://edition.cnn.com/2025/03/07/entertainment/pamela-bach-actor-hasselhoff-dies-hnk/index.html"
},
{
    "title": "The farthest spacecraft from Earth are shutting off instruments in interstellar space",
    "date": "6:25 PM EST, Wed March 5, 2025",
    "author": "Ashley Strickland",
    "content": ".\n \n            NASA’s twin Voyager probes, which launched 47 years ago, are shutting off some science instruments in an effort to conserve power and keep their storied missions going. Voyager 1 and Voyager 2 are both exploring uncharted territory in interstellar space.\n     \n            Engineer...",
    "url": "https://edition.cnn.com/2025/03/05/science/voyager-probes-turn-off-instruments/index.html"
},
{
    "title": "Ecuadorian president offers carte blanche to police and military after attack kills 22 in Guayaquil",
    "date": "2:53 PM EST, Fri March 7, 2025",
    "author": "Ana Maria Canizares",
    "content": "Ecuadorian President Daniel Noboa   for police and military personnel responding to an armed attack that killed at least 22 in the southern city of Guayaquil yesterday.\n     \n            “We need you to act decisively and without fear of reprisal,” Noboa wrote in a post on X on Friday morning. “D...",
    "url": "https://edition.cnn.com/2025/03/07/americas/ecuador-noboa-pardons-attack-latam-intl/index.html"
},
{
    "title": "See how Russian state-owned networks are changing their tune on the US",
    "date": "6:36 PM EST, Thu March 6, 2025",
    "author": "Matthew Chance",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/06/world/video/russian-tv-reaction-trump-ukraine-us-chance-pkg-ac360-digvid"
},
{
    "title": "Sudan launches case against United Arab Emirates at World Court",
    "date": "12:36 PM EST, Fri March 7, 2025",
    "author": "N/A",
    "content": "Sudan has filed a case against the United Arab Emirates at the World Court for allegedly violating its obligations under the Genocide Convention by arming the paramilitary Rapid Support Forces, the International Court of Justice said on Thursday.\n     \n            The United Arab Emirates said it...",
    "url": "https://edition.cnn.com/2025/03/07/middleeast/sudan-uae-icj-intl-latam/index.html"
},
{
    "title": "Hundreds killed in Syria clashes, rights monitoring group says, in worst violence since ouster of Assad regime",
    "date": "4:29 PM EST, Fri March 7, 2025",
    "author": "Eyad Kourdi",
    "content": "In the worst outbreak of unrest since Syria’s transitional government , hundreds of people have been killed or wounded in clashes between the security forces and supporters of former President Bashar al Assad this week, according to a human rights monitoring group.\n     \n            The clashes b...",
    "url": "https://edition.cnn.com/2025/03/07/middleeast/syria-army-assad-deadly-clashes-intl/index.html"
},
{
    "title": "Inside Trump and DOGE’s chaotic effort to release billions of gallons of California’s water",
    "date": "6:16 AM EST, Fri March 7, 2025",
    "author": "Ella Nilsen",
    "content": "Representatives from the Department of Government Efficiency repeatedly pressured the head of a United States water management agency to open a major California pump system in late January, intending to   south toward Los Angeles — even though the water would have never made it to the fire-scarre...",
    "url": "https://edition.cnn.com/2025/03/07/climate/trump-doge-california-water/index.html"
},
{
    "title": "Is this the only known portrait of England’s doomed ‘Nine Days Queen’?",
    "date": "9:23 AM EST, Fri March 7, 2025",
    "author": "Amarachi Orie",
    "content": "Lady Jane Grey, a teenage pawn in the power struggles that plagued the   court, ruled England for just nine days and was later executed for treason. Now, researchers believe they may have identified the only known portrait of the so-called “Nine Days Queen” painted before her death.\n     \n       ...",
    "url": "https://edition.cnn.com/2025/03/07/style/lady-jane-grey-portrait-england-intl-scli-gbr/index.html"
},
{
    "title": "‘The beginning of the seizure of democracy’: French politician takes aim at President Trump",
    "date": "6:02 PM EST, Thu March 6, 2025",
    "author": "Samantha Lindell",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/06/politics/video/french-politician-criticizes-trumps-response-ukraine-digvid"
},
{
    "title": "A striking new visualization looks like a flower in bloom but tells an alarming story about what’s happening to the planet",
    "date": "6:30 AM EST, Fri March 7, 2025",
    "author": "Laura Paddison",
    "content": "A striking new visualization made by climate scientist Zeke Hausfather unfurls like a flower blooming in the spring, its colors moving from blue to red. It may look beautiful but what it reveals is an  .\n     \n            The graphic shows the increase in daily global temperatures between 1940 an...",
    "url": "https://edition.cnn.com/2025/03/07/climate/visual-temperature-rise/index.html"
},
{
    "title": "The Trump revolution is being slowed by its own political debris field",
    "date": "8:35 AM EST, Fri March 7, 2025",
    "author": "Stephen Collinson",
    "content": "It was the week reality began to catch up with the White House.\n     \n            President Donald Trump made clear in his   of Congress on Tuesday night there will be no let-up in his relentless pace, his attempts to maximize executive power and his shake-up of the country and the world.\n     \n ...",
    "url": "https://edition.cnn.com/2025/03/07/politics/trump-revolution-slowed-down-analysis/index.html"
},
{
    "title": "DOGE attempts to enter an agency building led to physical standoff that spilled into court",
    "date": "9:44 AM EST, Fri March 7, 2025",
    "author": "Katelyn  Polantz",
    "content": "A small federal agency that sends money to help communities in Africa became a flashpoint Thursday in the Trump administration’s efforts to shut down foreign aid and reduce the size of the federal government.\n     \n            A Trump-backed government official, staffers from the Department of Go...",
    "url": "https://edition.cnn.com/2025/03/07/politics/us-african-development-agency-standoff/index.html"
},
{
    "title": "‘Fate is screaming at us to do something’: How pilots are reacting to the slew of recent aviation incidents",
    "date": "6:06 AM EST, Fri March 7, 2025",
    "author": "Julia Buckley",
    "content": ".  . And, of course, the  which have    in recent weeks.\n     \n            It’s little wonder that public confidence in flying has taken a tumble in recent weeks.\n     \n            A poll carried out by the   in February, after the fatal DC crash of an American Airlines plane and a helicopter, sh...",
    "url": "https://edition.cnn.com/travel/pilots-flying-safety-public-confidence/index.html"
},
{
    "title": "China slams Trump’s return to the ‘law of the jungle’",
    "date": "2:40 AM EST, Fri March 7, 2025",
    "author": "Simone McCarthy",
    "content": "If every country were to put itself first, the ‘law of the jungle’ would return, China’s Foreign Minister Wang Yi said on Friday in response to a question from CNN’s Steven Jiang about US President Donald Trump’s “America First” policy.\n     \n            “There are more than 190 countries in the ...",
    "url": "https://edition.cnn.com/2025/03/07/china/china-wang-yi-press-conference-trump-intl-hnk/index.html"
},
{
    "title": "Can NATO survive without the United States?",
    "date": "3:48 AM EST, Fri March 7, 2025",
    "author": "Brad Lendon",
    "content": "Europe is staring down the barrel of a stark new reality where the United States being the backbone of NATO – the alliance that has guaranteed the continent’s security for almost 80 years – is no longer a given.\n     \n            President Donald Trump’s   towards Ukraine’s Volodymyr Zelensky, hi...",
    "url": "https://edition.cnn.com/2025/03/07/europe/nato-ukraine-survive-without-united-states-analysis-intl-hnk-ml/index.html"
},
{
    "title": "Newly released texts reveal panic between surviving roommates in Idaho murders",
    "date": "9:46 AM EST, Fri March 7, 2025",
    "author": "Ellen Rittiner",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/07/us/video/idaho-kohberger-roommates-textscasarez-digvid"
},
{
    "title": "Russia launches major aerial assault on Ukraine days after US shut off military aid",
    "date": "4:52 PM EST, Fri March 7, 2025",
    "author": "Daria Tarasova-Markina",
    "content": "Russia fired cruise and ballistic missiles at   in a major overnight attack, Volodymyr Zelensky said Friday, as the Ukrainian president renewed his plea for a partial ceasefire at the end of a week in which the   suspended military aid and intelligence sharing with Kyiv.\n     \n            Russia’...",
    "url": "https://edition.cnn.com/2025/03/07/world/russia-aerial-assault-ukraine-us-pause-military-aid-intl/index.html"
},
{
    "title": "‘My jaw is dropped’: Canadian official’s interview stuns Amanpour",
    "date": "3:14 PM EST, Thu March 6, 2025",
    "author": "N/A",
    "content": "No content available",
    "url": "https://edition.cnn.com/2025/03/06/politics/video/melanie-joly-canada-trump-christiane-amanpour-digvid"
},
{
    "title": "Poland’s Tusk plans large-scale military training for all adult males to boost reserves",
    "date": "12:09 PM EST, Fri March 7, 2025",
    "author": "Associated Press",
    "content": "Prime Minister Donald Tusk said Friday that his government is working on a plan to prepare large-scale military training for every adult male in response to the  .\n     \n            Tusk told the country’s Sejm, the lower house of parliament, that the military training would create a reserve forc...",
    "url": "https://edition.cnn.com/2025/03/07/europe/poland-military-training-adult-men-nato-intl-latam/index.html"
},
{
    "title": "Prosecutors allege Sean ‘Diddy’ Combs forced employee to engage in sex act in amended indictment",
    "date": "6:37 PM EST, Thu March 6, 2025",
    "author": "Kara Scannell",
    "content": "Federal prosecutors allege  forced an employee to engage in sex acts and threatened others with physical force and financial harm if they did not help him carry out a sex trafficking scheme that lasted two decades, according to a superseding indictment unsealed Thursday.\n     \n            The add...",
    "url": "https://edition.cnn.com/2025/03/06/entertainment/sean-diddy-combs-amended-indictment-employee/index.html"
},
{
    "title": "The world is coming to America for next summer’s World Cup. There are big concerns over whether the US is ready",
    "date": "4:21 PM EST, Fri March 7, 2025",
    "author": "Kyle Feldscher",
    "content": "The    , but top travel executives are warning the US could struggle to effectively stage the tournament unless big changes are made quickly.\n     \n            US Travel Association president and CEO Geoff Freeman and MGM Resorts International president and CEO William Hornbuckle told CNN Sport t...",
    "url": "https://edition.cnn.com/2025/03/06/sport/2026-world-cup-usa-travel-spt/index.html"
},
{
    "title": "Trump threatens new tariffs on Canada, including 250% tax on dairy",
    "date": "4:41 PM EST, Fri March 7, 2025",
    "author": "David Goldman",
    "content": "A day after offering Canada   on punishing, virtually across-the-board 25% tariffs, President Donald Trump has threatened new tariffs as soon as Friday on Canadian lumber and dairy products. It’s yet another twist in a serpentine trade policy that seems to shift on an hourly basis.\n     \n        ...",
    "url": "https://edition.cnn.com/2025/03/07/business/tariffs-trump-canada/index.html"
},
{
    "title": "N/A",
    "date": "5:12 PM EST, Fri March 7, 2025",
    "author": "Leinz Vales",
    "content": "No content available",
    "url": "https://edition.cnn.com/politics/live-news/trump-administration-presidency-news-03-07-25/index.html"
},
{
    "title": "SpaceX’s Starship spacecraft explodes midflight for a second time, disrupting Florida air traffic",
    "date": "2:17 AM EST, Fri March 7, 2025",
    "author": "Ashley Strickland",
    "content": "A SpaceX Starship spacecraft, the upper portion of the most powerful launch system ever built, exploded during its eighth test flight Thursday, disrupting air traffic and marking the   for the vehicle this year.\n     \n            The uncrewed Starship mission lifted off at 5:30 p.m. CT (6:30 p.m....",
    "url": "https://edition.cnn.com/2025/03/06/science/starship-launch-test-flight-8/index.html"
},
{
    "title": "Pope Francis thanks well-wishers in first audio message since hospitalization",
    "date": "2:25 AM EST, Fri March 7, 2025",
    "author": "Edward Szekeres",
    "content": "Pope Francis thanked his supporters for their prayers on Thursday in a breathless audio message that nonetheless lifted spirits among his faithful as concerns grow for the 88-year-old pontiff’s health.\n     \n            The Pope’s pre-recorded remarks, broadcast on loudspeakers at the Vatican’s S...",
    "url": "https://edition.cnn.com/2025/03/07/europe/pope-francis-audio-message-intl-hnk/index.html"
},
{
    "title": "What does King Charles listen to? Kylie Minogue and RAYE, according to his Apple Music playlist",
    "date": "5:48 AM EST, Fri March 7, 2025",
    "author": "Jessie Yeung",
    "content": "When   gets up in the morning, what tunes does he select to start his day?\n     \n            It’s a mix of genres across decades, according to a new Apple Music broadcast show and playlist the monarch has curated – from reggae legend Bob Marley to the more recently Grammy-nominated singer-songwri...",
    "url": "https://edition.cnn.com/2025/03/07/uk/king-charles-apple-music-playlist-intl-hnk/index.html"
},
{
    "title": "Paris Fashion Week brought out big stars — here’s what they wore",
    "date": "12:11 AM EST, Fri March 7, 2025",
    "author": "Kati Chitrakorn",
    "content": "Editor’s Note: CNN Style is one of the official media partners of Paris Fashion Week. See all coverage  \n \n            The Fall-Winter 2025 edition of   is underway, with infectious energy and eye-catching looks seen both on and off the runways.\n     \n            At the nine-day event, running un...",
    "url": "https://edition.cnn.com/2025/03/06/style/paris-fashion-week-celebrity-looks-fall-winter-2025/index.html"
}
]